public class Stars1 {
	
	//编写一个main方法
	public static void main(String[] args) {
		
		/*
		 空心金字塔
		 
		 思路分析
		 化繁为简
		 1. 先打印一个矩形
		 *****
		 *****
		 *****
		 *****
		 *****
		 2. 打印半个金字塔
		 *
		 **
		 ***
		 *****
		 ******
		 
		 3.打印整个金字塔
		     *          //第一层 有1个*	2*1-1	4个空格=总层数-1
		    ***         //第二层 有3个*	2*2-1	3个空格=总层数-2
		   *****		//第三层 有5个*	2*3-1	2个空格=总层数-3
		  *******		//第四层 有7个*	2*3-1	1个空格=总层数-4
		 *********		//第五层 有9个*	2*5-1	0个空格=总层数-5
		
		4. 打印空心的金字塔
		     *          //第一层 有1个*	当前行首位末位是*
		    * *         //第二层 有2个*	当前行首位末位是*
		   *   *		//第三层 有2个*	当前行首位末位是*
		  *     *		//第四层 有2个*	当前行首位末位是*
		 *********		//第五层 有9个*	全部输出*
		
		
		先死后活
		5 层数做成变量 int totalLevel = 5
		 
		 */
		int totalLeaval = 5; //层数
		for(int i = 1; i <= totalLeaval ; i++) { //i 表示层数
			
			//在输出*之前 还要输出 对应空格 总层数-当前层
			for(int k = 1; k <= totalLeaval - i; k++) {
				System.out.print(" ");
			}
			//控制打印每层*的个数
			for(int j = 1; j <= 2*i - 1; j++) {
				//当前行的首位是*，末位是* ，最后一层全是*
				if(j == 1 || j == 2 * i - 1 || i==totalLeaval) {
					System.out.print("*");
				} else { //其他情况输出空格
					System.out.print(" ");
				}
				
			}
		//每打印完一层的*后，就换行，println 换行输出
			System.out.println("");
		}
	}
}